{
  "title": "Terms of Use",
  "general.title": "1. General Information",
  "general.appName": "Application Name: StorageR",
  "general.provider": "Service Provider: Reterics Attila EV. (registered sole proprietorship in Hungary)",
  "general.address": "Address: 8985 Becsvölgye, Arany János út 5/A",
  "general.tax": "Tax number: 57823357-1-40",
  "general.reg": "Registration number: 56484076",
  "general.email": "Email: attila@reterics.com",
  "general.phone": "Phone: +36 30 7225104",
  "hosting.title": "2. Hosting Provider",
  "hosting.provider": "Nethely Kft.",
  "hosting.hq": "Headquarters: 1115 Budapest, Halmi utca 29.",
  "hosting.branch": "Branch: 6724 Szeged, Teréz utca 34.",
  "hosting.tax": "Tax ID: 23358005-2-43",
  "hosting.vat": "EU VAT: HU23358005",
  "hosting.reg": "Company Reg.: 01-09-961790",
  "hosting.account": "Account: OTP 11711003-20007085",
  "hosting.swift": "SWIFT: OTPVHUHB",
  "hosting.iban": "IBAN: HU51117110032000708500000000",
  "hosting.website": "Website: nethely.hu",
  "hosting.email": "Email: info@nethely.hu (Mon–Fri 8:30–22:00)",
  "hosting.phone": "Phone: +36 1 800 1500 (Mon–Fri 8:30–17:00)",
  "thirdparty.title": "3. Third-Party Services",
  "thirdparty.text1": "StorageR uses services provided by Google Firebase, including Authentication and Firestore.",
  "thirdparty.text2": "These are governed by the Firebase Terms and their Privacy Policy.",
  "scope.title": "4. Scope of Use",
  "scope.text1": "StorageR is a cloud-based system for rental and inventory management.",
  "scope.text2": "Users must use the system lawfully and as intended.",
  "liability.title": "5. Service Provider’s Liability",
  "liability.items": [
    "Strives to maintain continuous availability, but 100% uptime is not guaranteed.",
    "Not responsible for data loss caused by the user.",
    "No liability for indirect or consequential damages.",
    "Not liable for third-party failures (e.g., Firebase, hosting).",
    "Liability is limited to the fees paid in the last 3 months."
  ],
  "user.title": "6. User Responsibilities",
  "user.items": [
    "Provide accurate and lawful information.",
    "Keep login credentials confidential.",
    "Use the service only for lawful purposes.",
    "The user is responsible for their own actions on the platform."
  ],
  "user.text1": "Users are solely responsible for the accuracy of the data they provide or upload. The Service Provider shall not be liable for damages arising from incorrect, incomplete, or misleading data input, regardless of whether the service is free or paid.",
  "user.text2": "Users are responsible for ensuring that the data they submit has been successfully saved within the application. In the event of an error, it may be difficult to determine whether the issue originated from the user’s device, internet connection, an external provider (e.g. Firebase), or the StorageR system itself.",
  "data.title": "7. Data Protection",
  "data.text1": "Data is encrypted in transit and at rest (using Firebase services).",
  "data.text2": "We do not sell or share personal data with third parties.",
  "data.text3": "StorageR adheres to GDPR requirements.",
  "data.text4": "User-related data is stored locally in the browser using localStorage and IndexedDB for caching purposes only, to improve performance and user experience.",
  "rights.title": "8. User Rights under GDPR",
  "rights.items": [
    "Right of Access: You can request information on whether we process your personal data and obtain a copy of it.",
    "Right to Rectification: You can request that we correct any inaccuracies in your personal data.",
    "Right to Erasure: You can request the deletion of your personal data in certain circumstances (for example, if it is no longer needed for the purposes it was collected).",
    "Right to Data Portability: You can request a copy of your personal data in a structured, commonly used electronic format, and you can ask us to transfer it to another service provider where feasible.",
    "Right to Withdraw Consent: If we process your personal data based on your consent, you have the right to withdraw that consent at any time (this will not affect the lawfulness of processing before withdrawal).",
    "Right to Object: You can object to the processing of your personal data for certain purposes, such as direct marketing or when processing is based on our legitimate interests.",
    "Right to Lodge a Complaint: You have the right to lodge a complaint with a data protection supervisory authority (for example, the Hungarian National Authority for Data Protection and Freedom of Information – NAIH)."
  ],
  "cookie.title": "9. Cookie Policy",
  "cookie.text1": "StorageR uses cookies and similar technologies to ensure the proper functioning of the website and to enhance the user experience.",
  "cookie.text2": "We use essential cookies that are necessary for the operation of the service (these do not require user consent). With your consent, we may also use analytics cookies or similar technologies to collect information about how you use our site, which helps us improve our services.",
  "cookie.text3": "Users have control over non-essential cookies. We will request your consent before using non-essential cookies, and you can withdraw your consent at any time. You can manage or disable cookies in your web browser settings; however, note that disabling certain cookies may affect functionality of the service.",
  "dispute.title": "10. Governing Law and Dispute Resolution",
  "dispute.text1": "These Terms of Use are governed by the laws of Hungary. The parties will seek to resolve any disagreements amicably. If an amicable resolution cannot be reached, any dispute arising from or related to these terms or the use of the StorageR service shall fall under the jurisdiction of the courts of Hungary.",
  "dispute.text2": "If you are a consumer, you have the option to pursue out-of-court dispute resolution before resorting to litigation. You may contact the Conciliation Board of Zala County (address: 8900 Zalaegerszeg, Petőfi utca 24., email: zmbekelteto@zmkik.hu, phone: +36 92 550 513), or the competent conciliation body in your area. Additionally, you can use the EU online dispute resolution platform at https://ec.europa.eu/consumers/odr.",
  "custom.title": "",
  "custom.text1": "",
  "custom.text2": ""
}
