{
  "title": "Felhasználási feltételek",
  "general.title": "1. Általános információk",
  "general.appName": "Alkalmazás neve: StorageR",
  "general.provider": "Szolgáltató: {{provider}}",
  "general.address": "Székhely: {{address}}",
  "general.tax": "Adószám: {{tax}}",
  "general.reg": "Nyilvántartási szám: {{reg}}",
  "general.email": "Email: {{email}}",
  "general.phone": "Telefon: {{phone}}",
  "hosting.title": "2. Tárhelyszolgáltató",
  "hosting.provider": "Nethely Kft.",
  "hosting.hq": "Székhely: 1115 Budapest, Halmi utca 29.",
  "hosting.branch": "Fióktelep: 6724 Szeged, Teréz utca 34.",
  "hosting.tax": "Adószám: 23358005-2-43",
  "hosting.vat": "Közösségi adószám: HU23358005",
  "hosting.reg": "Cégjegyzékszám: 01-09-961790",
  "hosting.account": "Bankszámla: OTP 11711003-20007085",
  "hosting.swift": "Swift kód: OTPVHUHB",
  "hosting.iban": "IBAN: HU51117110032000708500000000",
  "hosting.website": "Weboldal: nethely.hu",
  "hosting.email": "Email: info@nethely.hu (H–P 8:30–22:00)",
  "hosting.phone": "Telefon: +36 1 800 1500 (H–P 8:30–17:00)",
  "thirdparty.title": "3. Külső szolgáltatások",
  "thirdparty.text1": "A StorageR a Google Firebase szolgáltatásait használja, beleértve az azonosítást és az adatbázist.",
  "thirdparty.text2": "Ezekre a Firebase Általános Szerződési Feltételei és Adatvédelmi Irányelvei vonatkoznak.",
  "scope.title": "4. Használat terjedelme",
  "scope.text1": "A StorageR egy felhőalapú rendszer bérlés és készletkezelés céljára.",
  "scope.text2": "A felhasználóknak jogszerűen kell használniuk a rendszert, annak rendeltetésének megfelelően.",
  "liability.title": "5. Szolgáltató felelőssége",
  "liability.items": [
    "A StorageR alkalmazás az MIT licenc alapján kerül biztosításra, és „adott állapotában” („as is”) használható, bármilyen garancia nélkül.",
    "A Szolgáltató törekszik a folyamatos elérhetőség biztosítására, de a 100%-os rendelkezésre állást nem garantálja.",
    "A Szolgáltató nem vállal felelősséget a felhasználó által okozott adatvesztésért.",
    "A Szolgáltató nem vállal felelősséget közvetett vagy következményes károkért.",
    "A Szolgáltató által nyújtott díjköteles szolgáltatások (például egyedi fejlesztések, telepítések vagy üzemeltetés) esetében a felelősség maximum az igényt megelőző utolsó 3 hónapban kifizetett díjak összegére korlátozódik.",
    "A Szolgáltató nem felel harmadik fél szolgáltatásainak hibáiért (pl. Firebase, tárhelyszolgáltató)."
  ],
  "user.title": "6. Felhasználó kötelezettségei",
  "user.items": [
    "Valós, jogszerű adatokat kell megadni.",
    "A bejelentkezési adatok titokban tartása kötelező.",
    "Csak jogszerű célokra használható.",
    "A felhasználó felel saját tevékenységéért."
  ],
  "user.text1": "A felhasználó kizárólagos felelősséggel tartozik az általa megadott vagy feltöltött adatok pontosságáért. A Szolgáltató nem vállal felelősséget a hibás, hiányos vagy félrevezető adatbevitelből eredő károkért, függetlenül attól, hogy a szolgáltatás díjköteles vagy ingyenes.",
  "user.text2": "A felhasználónak kötelessége meggyőződni arról, hogy az általa beküldött adatok sikeresen mentésre kerültek az alkalmazásban. Esetleges hibák esetén nehéz lehet egyértelműen megállapítani, hogy a probléma a felhasználó eszközéből, internetkapcsolatából, külső szolgáltatóból (pl. Firebase), vagy a StorageR rendszeréből ered.",
  "data.title": "7. Adatvédelem",
  "data.text1": "Az adatok titkosítva vannak átvitel és tárolás során is (Firebase).",
  "data.text2": "Az adatok nem kerülnek értékesítésre vagy megosztásra.",
  "data.text3": "A StorageR megfelel a GDPR követelményeinek.",
  "data.text4": "A felhasználói adatok a böngésző localStorage és IndexedDB tárhelyeiben kerülnek tárolásra gyorsítótárazási céllal, a teljesítmény és a felhasználói élmény javítása érdekében.",

  "system.title": "Rendszerkövetelmények",
  "system.browser.title": "Támogatott böngészők",
  "system.browser.items": [
    "Google Chrome 107 vagy újabb",
    "Microsoft Edge 107 vagy újabb",
    "Mozilla Firefox 104 vagy újabb",
    "Apple Safari 16.0 vagy újabb"
  ],
  "system.tablet.title": "Ajánlott minimum Android táblagép",
  "system.tablet.items": [
    "3 GB RAM",
    "1920x1200 felbontás (HD)",
    "Android 12 vagy újabb"
  ],
  "system.device.title": "Tesztelt eszköz",
  "system.device.text": "A megvalósítás és a tesztelés Lenovo Tab M10 (3. generáció) - TB328FU eszközön történt.",

  "rights.title": "8. A felhasználó jogai a GDPR alapján",
  "rights.items": [
    "Hozzáféréshez való jog: A felhasználó jogosult tájékoztatást kérni arról, hogy kezeljük-e a személyes adatait, és jogosult a kezelt adatokhoz hozzáférést kapni.",
    "Helyesbítéshez való jog: Kérheti, hogy pontatlan személyes adatait javítsuk vagy kiegészítsük.",
    "Törléshez való jog: Bizonyos esetekben kérheti személyes adatainak törlését (\"elfeledtetéshez való jog\"; például ha az adatokra már nincs szükség a gyűjtésük céljából).",
    "Adathordozhatósághoz való jog: Kérheti, hogy az Ön által megadott személyes adatokat strukturált, széles körben használt, géppel olvasható formátumban megkapja, és – ha technikailag megvalósítható – kérheti ezen adatok továbbítását egy másik szolgáltatóhoz.",
    "A hozzájárulás visszavonásának joga: Ha az adatkezelés az Ön hozzájárulásán alapul, jogosult a hozzájárulását bármikor visszavonni (a visszavonás előtt végzett adatkezelés jogszerűségét ez nem érinti).",
    "Tiltakozáshoz való jog: Jogosult tiltakozni személyes adatai bizonyos kezelése ellen, például ha az adatkezelés jogalapja jogos érdek vagy ha adatait közvetlen üzletszerzési (direkt marketing) céllal használjuk.",
    "Panasztételi jog: Jogosult panaszt benyújtani egy felügyeleti hatóságnál. Magyarországon az illetékes hatóság a Nemzeti Adatvédelmi és Információszabadság Hatóság (NAIH)."
  ],
  "cookie.title": "9. Cookie-k (sütik) használata",
  "cookie.text1": "A StorageR cookie-kat (sütiket) és hasonló technológiákat használ a weboldal megfelelő működésének biztosítása és a felhasználói élmény javítása érdekében.",
  "cookie.text2": "Olyan szükséges cookie-kat alkalmazunk, amelyek elengedhetetlenek a szolgáltatás működéséhez (ezekhez nincs szükség külön hozzájárulásra). Az Ön beleegyezésével emellett analitikai célú cookie-kat is használhatunk, amelyek információkat gyűjtenek a weboldal használatáról a szolgáltatásaink fejlesztése érdekében.",
  "cookie.text3": "A felhasználó ellenőrzést gyakorolhat a nem alapvető cookie-k felett. Az ilyen cookie-k használata előtt engedélyt kérünk, és a hozzájárulás bármikor visszavonható. A cookie-kat a böngésző beállításaiban is tudja kezelni vagy törölni; azonban felhívjuk a figyelmet, hogy bizonyos cookie-k letiltása a szolgáltatás egyes funkcióit érintheti.",
  "dispute.title": "10. Alkalmazandó jog és vitarendezés",
  "dispute.text1": "A jelen Felhasználási feltételekre Magyarország joga irányadó. A felek megállapodnak, hogy a felmerülő vitás kérdéseket elsősorban békés úton rendezik. Amennyiben ez nem vezet eredményre, a felek közötti jogviták elbírálására a magyar bíróságok rendelkeznek illetékességgel.",
  "dispute.text2": "Amennyiben a Felhasználó fogyasztónak minősül, jogosult a bírósági eljárás előtt békéltető testületi eljárást kezdeményezni. A Szolgáltató székhelye szerinti illetékes testület a Zala Megyei Békéltető Testület (cím: 8900 Zalaegerszeg, Petőfi utca 24., e-mail: zmbekelteto@zmkik.hu, telefon: +36 92 550 513). Emellett igénybe vehető az Európai Bizottság online vitarendezési platformja is (https://ec.europa.eu/consumers/odr).",
  "custom.title": "",
  "custom.text1": "",
  "custom.text2": ""
}
